Updates to KT
